sin1111yi/ThetaGP/platform/STM32/system/target/target_platform.h
#pragma once

#ifdef __cplusplus
extern "C" {
#endif

#if defined(STM32H7)

// ── LL Library Includes (all peripherals) ──
#include "stm32h7xx_ll_adc.h"
#include "stm32h7xx_ll_bdma.h"
#include "stm32h7xx_ll_bus.h"
#include "stm32h7xx_ll_comp.h"
#include "stm32h7xx_ll_cordic.h"
#include "stm32h7xx_ll_cortex.h"
#include "stm32h7xx_ll_crc.h"
#include "stm32h7xx_ll_crs.h"
#include "stm32h7xx_ll_dac.h"
#include "stm32h7xx_ll_delayblock.h"
#include "stm32h7xx_ll_dma.h"
#include "stm32h7xx_ll_dma2d.h"
#include "stm32h7xx_ll_dmamux.h"
#include "stm32h7xx_ll_exti.h"
#include "stm32h7xx_ll_fmac.h"
#include "stm32h7xx_ll_fmc.h"
#include "stm32h7xx_ll_gpio.h"
#include "stm32h7xx_ll_hrtim.h"
#include "stm32h7xx_ll_hsem.h"
#include "stm32h7xx_ll_i2c.h"
#include "stm32h7xx_ll_iwdg.h"
#include "stm32h7xx_ll_lptim.h"
#include "stm32h7xx_ll_lpuart.h"
#include "stm32h7xx_ll_mdma.h"
#include "stm32h7xx_ll_opamp.h"
#include "stm32h7xx_ll_pwr.h"
#include "stm32h7xx_ll_rcc.h"
#include "stm32h7xx_ll_rng.h"
#include "stm32h7xx_ll_rtc.h"
#include "stm32h7xx_ll_sdmmc.h"
#include "stm32h7xx_ll_spi.h"
#include "stm32h7xx_ll_swpmi.h"
#include "stm32h7xx_ll_system.h"
#include "stm32h7xx_ll_tim.h"
#include "stm32h7xx_ll_usart.h"
#include "stm32h7xx_ll_usb.h"
#include "stm32h7xx_ll_utils.h"
#include "stm32h7xx_ll_wwdg.h"

#define USB_DTCM_RAM
#define USB_ITCM_RAM
#define USB_RAM_D2
#define USB_RAM_D3

// ── Section attributes (platform memory regions) ──
// DTCMRAM: CPU-local fast RAM, 0-wait, not DMA-accessible
// RAM (AXI SRAM): system RAM, DMA-accessible
// RAM_BSS: same as RAM but NOLOAD (zero-init at boot, no Flash copy)
// RAM_D2 / RAM_D3: peripheral/backup RAM domains

#define DTCM_RAM_DATA __attribute__((section(".dtcmram_data")))
#define DTCM_RAM_BSS  __attribute__((section(".dtcmram_bss")))
#define RAM_DATA      __attribute__((section(".ram_data")))
#define RAM_BSS       __attribute__((section(".ram_bss")))
#define RAM_D2_DATA   __attribute__((section(".ram_d2_data")))
#define RAM_D3_DATA   __attribute__((section(".ram_d3_data")))

#else

// Non-H7 fallback: all section attrs are no-ops
// Variables land in default .data/.bss (usually DTCM or main SRAM)
#define DTCM_RAM_DATA
#define DTCM_RAM_BSS
#define RAM_DATA
#define RAM_BSS
#define RAM_D2_DATA
#define RAM_D3_DATA

#endif

#ifdef __cplusplus
}
#endif
